status/2022/0429.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-05-07 Sat 06:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>23 April 2022 - 29 April 2022</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Daniel Kelley" />
</head>
<body>
<div id="content">
<h1 class="title">23 April 2022 - 29 April 2022</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org715f6d3">1. MIT OCW</a>
<ul>
<li><a href="#orgd96624e">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#orge310d62">1.1.1. Session 55/PS7</a></li>
</ul>
</li>
<li><a href="#orge84dc90">1.2. 8.01X+8.01L - Physics I - Classical Mechanics with Labs</a>
<ul>
<li><a href="#org060f28c">1.2.1. Started Problem Set 2</a></li>
<li><a href="#orgee99a29">1.2.2. Planning experiment to measure 'g'</a></li>
</ul>
</li>
<li><a href="#orgc2b9891">1.3. 21G.701 Spanish</a>
<ul>
<li><a href="#orgaa68049">1.3.1. Finished Episodes 30-31 (no progress this week)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org49b702e">2. Mill Controller #2</a>
<ul>
<li><a href="#org2cad06c">2.1. Potential for using old Compaq iPaq boards.</a></li>
<li><a href="#orgd0faf12">2.2. May use OLPC in the meantime.</a></li>
<li><a href="#org48aa17c">2.3. Still having problems with mill controller booting reliably.</a></li>
</ul>
</li>
<li><a href="#org44812ad">3. OLPC</a>
<ul>
<li><a href="#org1b2c771">3.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#org6201433">4. Virtual Orchestra</a>
<ul>
<li><a href="#org87c917c">4.1. Continued Bolero coding</a></li>
<li><a href="#orgff523ae">4.2. Initial playback using fluidsynth</a></li>
<li><a href="#org9c6737b">4.3. Audio via liquidsfz</a></li>
</ul>
</li>
<li><a href="#org78d96a1">5. Quilting Frame Desk</a>
<ul>
<li><a href="#orgf5c8547">5.1. Edge Banding done</a></li>
<li><a href="#org538ebde">5.2. Leg brackets done</a></li>
<li><a href="#org6354070">5.3. Routing leg edges done</a></li>
<li><a href="#orgcd30c42">5.4. Routing top leg bracket pockets done</a></li>
</ul>
</li>
<li><a href="#org08a6f3e">6. David Davies</a>
<ul>
<li><a href="#orga75a156">6.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orgb80d42b">6.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org7a08143">6.3. Next hearing 4/29/2022.</a></li>
</ul>
</li>
<li><a href="#org3498798">7. Peter Kim</a>
<ul>
<li><a href="#org8945a9d">7.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#orgd905904">7.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#org07579f7">7.3. Change of Plea Hearing set for 5/31/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org715f6d3" class="outline-2">
<h2 id="org715f6d3"><span class="section-number-2">1</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd96624e" class="outline-3">
<h3 id="orgd96624e"><span class="section-number-3">1.1</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orge310d62" class="outline-4">
<h4 id="orge310d62"><span class="section-number-4">1.1.1</span> Session 55/PS7</h4>
</div>
</div>
<div id="outline-container-orge84dc90" class="outline-3">
<h3 id="orge84dc90"><span class="section-number-3">1.2</span> 8.01X+8.01L - Physics I - Classical Mechanics with Labs</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-org060f28c" class="outline-4">
<h4 id="org060f28c"><span class="section-number-4">1.2.1</span> Started Problem Set 2</h4>
</div>
<div id="outline-container-orgee99a29" class="outline-4">
<h4 id="orgee99a29"><span class="section-number-4">1.2.2</span> Planning experiment to measure 'g'</h4>
</div>
</div>
<div id="outline-container-orgc2b9891" class="outline-3">
<h3 id="orgc2b9891"><span class="section-number-3">1.3</span> 21G.701 Spanish</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-orgaa68049" class="outline-4">
<h4 id="orgaa68049"><span class="section-number-4">1.3.1</span> Finished Episodes 30-31 (no progress this week)</h4>
</div>
</div>
</div>
<div id="outline-container-org49b702e" class="outline-2">
<h2 id="org49b702e"><span class="section-number-2">2</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org2cad06c" class="outline-3">
<h3 id="org2cad06c"><span class="section-number-3">2.1</span> Potential for using old Compaq iPaq boards.</h3>
</div>
<div id="outline-container-orgd0faf12" class="outline-3">
<h3 id="orgd0faf12"><span class="section-number-3">2.2</span> May use OLPC in the meantime.</h3>
</div>
<div id="outline-container-org48aa17c" class="outline-3">
<h3 id="org48aa17c"><span class="section-number-3">2.3</span> Still having problems with mill controller booting reliably.</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Needs a new RTC battery.
</p>
</div>
</div>
</div>
<div id="outline-container-org44812ad" class="outline-2">
<h2 id="org44812ad"><span class="section-number-2">3</span> OLPC</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org1b2c771" class="outline-3">
<h3 id="org1b2c771"><span class="section-number-3">3.1</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-org6201433" class="outline-2">
<h2 id="org6201433"><span class="section-number-2">4</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org87c917c" class="outline-3">
<h3 id="org87c917c"><span class="section-number-3">4.1</span> Continued Bolero coding</h3>
</div>
<div id="outline-container-orgff523ae" class="outline-3">
<h3 id="orgff523ae"><span class="section-number-3">4.2</span> Initial playback using fluidsynth</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Awful, unless you <b>wanted</b> the bass clarinets to sound like farts.
</p>
</div>
</div>
<div id="outline-container-org9c6737b" class="outline-3">
<h3 id="org9c6737b"><span class="section-number-3">4.3</span> Audio via liquidsfz</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Trying sample renderer via liquidsfz.
</p>
</div>
</div>
</div>
<div id="outline-container-org78d96a1" class="outline-2">
<h2 id="org78d96a1"><span class="section-number-2">5</span> Quilting Frame Desk</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgf5c8547" class="outline-3">
<h3 id="orgf5c8547"><span class="section-number-3">5.1</span> Edge Banding done</h3>
</div>
<div id="outline-container-org538ebde" class="outline-3">
<h3 id="org538ebde"><span class="section-number-3">5.2</span> Leg brackets done</h3>
</div>
<div id="outline-container-org6354070" class="outline-3">
<h3 id="org6354070"><span class="section-number-3">5.3</span> Routing leg edges done</h3>
</div>
<div id="outline-container-orgcd30c42" class="outline-3">
<h3 id="orgcd30c42"><span class="section-number-3">5.4</span> Routing top leg bracket pockets done</h3>
</div>
</div>
<div id="outline-container-org08a6f3e" class="outline-2">
<h2 id="org08a6f3e"><span class="section-number-2">6</span> David Davies</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orga75a156" class="outline-3">
<h3 id="orga75a156"><span class="section-number-3">6.1</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orgb80d42b" class="outline-3">
<h3 id="orgb80d42b"><span class="section-number-3">6.2</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org7a08143" class="outline-3">
<h3 id="org7a08143"><span class="section-number-3">6.3</span> Next hearing 4/29/2022.</h3>
</div>
</div>
<div id="outline-container-org3498798" class="outline-2">
<h2 id="org3498798"><span class="section-number-2">7</span> Peter Kim</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org8945a9d" class="outline-3">
<h3 id="org8945a9d"><span class="section-number-3">7.1</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-orgd905904" class="outline-3">
<h3 id="orgd905904"><span class="section-number-3">7.2</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-org07579f7" class="outline-3">
<h3 id="org07579f7"><span class="section-number-3">7.3</span> Change of Plea Hearing set for 5/31/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2022-05-07 Sat 06:53</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
